{"1": {"id": "jobs/136386027792016070", "title": "Software Engineer II, Site Reliability Engineering, Google Cloud", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckUmz3v4UKIE99tkz_gRbF7tDqaeVjXvaxFkI76ULskCiEjsAbmRECY9Tt4bvQJs551fCAYY1z104Qjr3nuvflderklPfYD0vx-E9wkzXyp7xLVMEw1InadNpWDtdRA%3D%3D_V2&jobTitle=Software+Engineer+II&loc=US", "responsibilities": "\\nWrite product or system development code.\\nReview code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\\n\\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\\n\\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality. \\n\\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\\n\\n", "qualifications": "Minimum qualifications:\\nBachelor’s degree in Computer Science, a related field, or equivalent practical experience.\\nExperience with data structures/algorithms and software development in one or more programming languages. \\nPreferred qualifications:\\nMaster's degree in Computer Science or Engineering. \\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Pittsburgh, PA, USA", "lat": "40.44062479999999", "lon": "-79.9958864", "address_lines": "Pittsburgh, PA, USA", "city": "Pittsburgh", "post_code": "None", "country": "PA", "country_code": "US", "is_remote": "false", "description": "Site Reliability Engineering (SRE) combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems. SRE ensures that Google Cloud's services—both our internally critical and our externally-visible systems—have reliability, uptime appropriate to customer's needs and a fast rate of improvement. Additionally SRE’s will keep an ever-watchful eye on our systems capacity and performance. Much of our software development focuses on optimizing existing systems, building infrastructure and eliminating work through automation. On the SRE team, you’ll have the opportunity to manage the complex challenges of scale which are unique to Google Cloud, while using your expertise in coding, algorithms, complexity analysis and large-scale system design. SRE's culture of diversity, intellectual curiosity, problem solving and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.\\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.The US base salary range for this full-time position is $106,000-$159,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "education_levels": "BACHELORS_OR_EQUIVALENTMASTERS_OR_EQUIVALENT", "created": "2023-01-20T20:30:33.719Z", "modified": "2023-01-20T20:30:33.719Z", "publish_date": "2023-01-20T20:30:33.828Z"}, "2": {"id": "jobs/77645897447416518", "title": "Hardware Engineer, Hardware and Systems", "categories": "HARDWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2Fckfujt-yKY2ph73PeHN8ZU2GAlwZafyjP5jejv2oHscrXEjoAFAq7gtxiZ3hKnF5Nx_JPU-CcD4aCnfhXS01oOoL5tXqTRGeLCL4ts3k69LetVsY9yYt1BSlk0vL2_V2&jobTitle=Hardware+Engineer&loc=TW", "responsibilities": "\\nLead a sub-system and hardware design on data center hardware products.\\nBring up systems and execute engineering validation in the lab.\\nGather requirements, define high level architecture, execute hardware design, and product validation.\\nWork closely with engineering, manufacturing, product, and deployment teams to productize designs and field support.\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree in Electrical Engineering or a related field, or equivalent practical experience.\\nExperience in board design, validation, and with design tools (e.g. schematic capture, layout tools, lab bring up and debug).\\nExperience with high speed design, signal integrity, and power distribution techniques.\\nPreferred qualifications:\\nAdvanced degree in Electrical Engineering or a related field.\\n\\n5 years of experience with enterprise class hardware systems design, data center engineering, server, storage, and networking products.\\nExperience with FPGA/CPLD Design and interface with other disciplines, including software, thermal, and mechanical.\\nExperience solving complex system issues, technical innovation, and driving technical roadmap.\\nExperience collecting and organizing details to reproduce and explain results.\\nExcellent verbal and written communication skills.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Xindian District, New Taipei City, Taiwan", "lat": "24.978282", "lon": "121.5394822", "address_lines": "Xindian District, New Taipei City, Taiwan", "city": "Xindian District", "post_code": "None", "country": "New Taipei City", "country_code": "TW", "is_remote": "false", "description": "Our computational challenges are so big, complex and unique we can't just purchase off-the-shelf hardware, we've got to make it ourselves. Your team designs and builds the hardware, software and networking technologies that power all of Google's services. As a Hardware Engineer, you design and build the systems that are the heart of the world's largest and most powerful computing infrastructure. You develop from the lowest levels of circuit design to large system design and see those systems all the way through to high volume manufacturing. Your work has the potential to shape the machinery that goes into our cutting-edge data centers affecting millions of Google users. With your technical expertise, you lead projects in multiple areas of expertise (i.e., engineering domains or systems) within a data center facility, including construction and equipment installation/troubleshooting/debugging with vendors.\\nAs a Hardware Engineer, you will design and develop Google’s servers, storage devices, and specialized machine learning hardware for Google's data centers, ensuring they meet Google's stringent requirements for performance, security, reliability, and features.\\n\\nAs a member of a creative, motivated, and talented team, you will develop products for users. You'll be versatile and passionate about solving problems as we continue to push technology forward. You will work on hardware systems projects to craft solutions for data center deployments. You will work with product teams and various cross-functional requirements to ensure that their goals are met with your teams systems.Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "education_levels": "BACHELORS_OR_EQUIVALENTMASTERS_OR_EQUIVALENTDOCTORAL_OR_EQUIVALENT", "created": "2021-01-05T22:00:50.163Z", "modified": "2022-12-07T11:45:07.792Z", "publish_date": "2022-12-07T11:45:08.003Z"}, "3": {"id": "jobs/101106440338318022", "title": "Software Engineering Manager I, Silicon", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckWodPoqfbl0R0NH4oGr427FIB7pFHX6V02h8YtU_hErxEjoA4ixdmx0aqwD94DSiXGmH-ItK6x39VbMeb8svgf7U7OifDJIC5HKcRNEnZZzwlcBdhvpzK5mt9GbF_V2&jobTitle=Software+Engineering+Manager+I&loc=IN", "responsibilities": "\\nSet and communicate team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams.\\nSet clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching.\\nHelp develop and drive the short-term technical vision and roadmap within the scope of your team. Evolve the roadmap to meet anticipated future requirements and infrastructure needs. \\nDesign, guide and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems. \\n\\nReview code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\\n\\n", "qualifications": "Minimum qualifications:\\nBachelor’s degree, or equivalent practical experience.\\n\\n5 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\\n1.5 years of experience in a leadership role (technical leadership or people management, supervision, or team leadership).\\n\\nPreferred qualifications:\\nMaster's degree or PhD in Computer Science or related technical field.\\n\\n1 year of experience working in a complex, matrixed organization.\\n\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Bangalore, Karnataka, India", "lat": "17.385044", "lon": "78.486671", "address_lines": "Hyderabad, Telangana, India", "city": "Hyderabad", "post_code": "None", "country": "TG", "country_code": "IN", "is_remote": "false", "description": "Like Google's own ambitions, the work of a Software Engineer (SWE) goes way beyond just Search. SWE Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a SWE Manager you manage your project goals, contribute to product strategy and help develop your team. SWE teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.Google's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "education_levels": "BACHELORS_OR_EQUIVALENTMASTERS_OR_EQUIVALENTDOCTORAL_OR_EQUIVALENT", "created": "2022-09-30T12:00:50.597Z", "modified": "2022-12-07T11:06:09.707Z", "publish_date": "2022-12-07T11:06:09.803Z"}, "4": {"id": "jobs/76823609269461702", "title": "Test Engineer, Wearables", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckRG4RYffe0wXG5L4G12HVRWHPMSMGX3i4dfmoI28aR1IEjsA4ixdm1ayvl6A62uGjDwijYoIQGNEg0g9xZ-WupZlpEN136ZMfjANen9k4lQqufEx-gSjcKvXQAp_eQ%3D%3D_V2&jobTitle=Test+Engineer&loc=AU", "responsibilities": "\\nBe a consumer electronic system software and hardware architecture subject matter expert.\\nOwn and drive wearables testing and performance strategies for quality.\\nSet technical goals regarding platform roadmap and interface with counterparts, stakeholders and peers to drive team and test strategies. \\nDevelop scalable and reliable automated tests and frameworks for testing embedded hardware devices.\\nConceptualize and drive the implementation of advanced tools for improving pixel wearables product quality.\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree in Computer Science, Electrical Engineering, a related technical field, or equivalent practical experience.\\n5 years of experience in software testing and leading test engineering teams.\\nExperience in building testing frameworks, tools and automation within an enterprise environment.\\nPreferred qualifications:\\n3 years of experience in connectivity technologies such as Bluetooth or Wi-Fi.\\nExperience in defining, executing test strategies for  consumer electronic devices.\\nExperience with automated, end-to-end testing.\\nAbility to independently lead a test development project, including task planning and code reviews, working with software, hardware, firmware and networking engineers.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Sydney NSW, Australia", "lat": "-33.8649505", "lon": "151.2123105", "address_lines": "Level 6/151 Macquarie St, Sydney NSW 2000, Australia", "city": "Sydney", "post_code": "2000", "country": "NSW", "country_code": "AU", "is_remote": "false", "description": "At Google, our philosophy is build it, break it and then rebuild it better. That thinking is at the core of how we approach testing at Google. Unlike roles with similar names at the other companies, Test Engineers at Google aren't manual testers -- you write scripts to automate testing and create tools so developers can test their own code. As a Test Engineer, you navigate Google's massive codebase, identify weak spots and constantly design better and creative ways to break software and identify potential problems. You'll have a huge impact on the quality of Google's growing suite of products and services.\\nThe Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.", "education_levels": "BACHELORS_OR_EQUIVALENT", "created": "2022-09-19T08:30:41.298Z", "modified": "2022-12-07T11:16:12.700Z", "publish_date": "2022-12-07T11:16:12.863Z"}, "5": {"id": "jobs/143769314407654086", "title": "Connectivity Architect, Silicon Engineering", "categories": "HARDWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckUYH9FRfMRDk9Hd5QdImubximGzKxyUAeVp0LSE6aflaEjsA85OaoP0g1I-bcQf0WiEkaPSwFXtcocMk7sabNqd39Ch2JXe98lvm6HAxgXAHSFMC1Vn4AlIeoIoP0Q%3D%3D_V2&jobTitle=Connectivity+Architect&loc=TW", "responsibilities": "\\nLeverage expertise in platform architecture of large, heterogenous ASICs to help drive and design connectivity features.\\nWork with cross-functional teams to ensure architectural features are successfully deployed in the product.\\nAssist hardware and software architecture definition by defining software interfaces for connectivity hardware IPs, defining strategy for partitioning use cases and mapping those parts to various connectivity hardware IPs and defining, tracking and optimizing for relevant system-level Key Performance Indicators (KPIs).\\n", "qualifications": "Minimum qualifications:\\n3 years of experience in SoC network driver software/firmware design and linux kernel driver development.\\n2 years of experience in Wi-Fi/Modem SoC linux kernel driver and SoC interface driver.\\nPreferred qualifications:\\n5 years of experience in SoC network driver software/firmware design and linux kernel driver development.\\nExperience in one or more of the following: linux network stack, network offloading hardware, cellular/Wi-Fi /Bluetooth, and peripherals such as USB and PCIe.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Banqiao District, New Taipei City, Taiwan 220", "lat": "24.978282", "lon": "121.5394822", "address_lines": "Xindian District, New Taipei City, Taiwan", "city": "Xindian District", "post_code": "None", "country": "New Taipei City", "country_code": "TW", "is_remote": "false", "description": "Our computational challenges are so big, complex and unique we can't just purchase off-the-shelf hardware, we've got to make it ourselves. Your team designs and builds the hardware, software and networking technologies that power all of Google's services. As a Hardware Engineer, you design and build the systems that are the heart of the world's largest and most powerful computing infrastructure. You develop from the lowest levels of circuit design to large system design and see those systems all the way through to high volume manufacturing. Your work has the potential to shape the machinery that goes into our cutting-edge data centers affecting millions of Google users.\\nIn this role, you will contribute your networking software architecture expertise in architecture connectivity features in a large and complex heterogenous Application-specific integrated circuit (ASIC). You will work with multiple teams to help define state-of-the-art ASIC connectivity features.Google's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.", "education_levels": "None", "created": "2022-12-22T14:00:35.439Z", "modified": "2022-12-22T14:00:35.439Z", "publish_date": "2022-12-22T14:00:35.613Z"}, "6": {"id": "jobs/138162578460156614", "title": "Senior Software Engineering Manager", "categories": "PRODUCT_MANAGEMENTSOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckQaudaq9WgyFo2i4bzqc1JkqNewRm4L7AZJFPmn89IuTEjsAUT98bntqNw7-dMoc3df81FkJonYR-pgnY64Sa-zdldr02zMWl3-sjZA8FOs6Rn_Vw4Uvpydk8N_UnA%3D%3D_V2&jobTitle=Senior+Software+Engineering+Manager&loc=BR", "responsibilities": "\\nLead a team of Software Engineers focused on improving developer velocity, scalability, and testability of Google’s diverse project areas and platforms.\\nProvide technical expertise throughout the product life cycle including design, implementation, and delivery of scalable build/test/release infrastructure.\\nCreate the next generation developer tooling and infrastructure for Google, focusing on productivity, testing, and release.\\nDefine the team strategy and roadmap for the adoption of developer tools and test infrastructure for one or more products.\\nCollaborate with leadership and key stakeholders on a regular basis.\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree in Computer Science or related field, or equivalent practical experience.\\n3 years of direct technical leadership and people management experience.\\nProgramming experience in one of the following: Java, C++, or Python.\\nExperience developing automated internal frameworks, increasing developer and release velocity, improving code health, and building developer tools.\\nPreferred qualifications:\\nMaster's degree or PhD in Computer Science or related degree.\\n10 years of relevant industry experience, with 5 years of direct technical leadership and people management experience.\\nRelevant industry experience involving search optimization, ranking, and applied ML (Machine Learning) experience.\\nExperience designing and implementing large-scale distributed systems.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Belo Horizonte, State of Minas Gerais, Brazil", "lat": "-14.235004", "lon": "-51.92528", "address_lines": "Brazil", "city": "null", "post_code": "None", "country": "null", "country_code": "BR", "is_remote": "true", "description": "Like Google's own ambitions, the work of a Software Engineer (SWE) goes way beyond just Search. SWE Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a SWE Manager you manage your project goals, contribute to product strategy and help develop your team. SWE teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.With technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally.Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.", "education_levels": "BACHELORS_OR_EQUIVALENTMASTERS_OR_EQUIVALENTDOCTORAL_OR_EQUIVALENT", "created": "2021-05-17T18:31:10.186Z", "modified": "2023-01-05T17:00:51.749Z", "publish_date": "2023-01-05T17:00:51.987Z"}, "7": {"id": "jobs/88818575109694150", "title": "Senior Software Engineer, Site Reliability Engineering", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckcqS0bOuO_9tB3yAOHxcwRgsc5zzyHDRM8YXpiv_gadTEjsA85OaoIW17A8lPLvLO_RYdBAuW-UdTSO9v_fIPVhwbeLjICkqC4oKqJyPFWGtsTZ4YDcd1uWcMAWhbQ%3D%3D_V2&jobTitle=Senior+Software+Engineer&loc=CH", "responsibilities": "\\nLead designs of software components, systems, and features to improve the availability, scalability, latency, and efficiency of Google services.\\nLead sustainable incident response, blameless postmortems, and production improvements that result in direct business opportunities for Google.\\nProvide guidance to other team members on managing availability and performance of mission critical services, on building automation to prevent problem recurrence, and building automated responses for non-exceptional service conditions.\\n\\nMentor and train other team members on design techniques and coding standards, and to cultivate innovation and collaboration across multiple teams.\\nManage individual projects priorities, deadlines, and deliverables.\\n", "qualifications": "Minimum qualifications:\\nExperience with architecting, developing, and troubleshooting systems.\\nExperience with designing, building, and maintaining production services.\\nExperience with algorithms, data structures, complexity analysis, and software design.\\nExperience coding in one or more of the following programming languages (e.g., C, C++, Java, Python, Go).\\nPreferred qualifications:\\nBachelor's degree in Computer Science or a related technical field (e.g., physics, mathematics).\\nExperience with designing, analyzing, and troubleshooting large-scale distributed systems.\\nExperience working in computing, distributed systems, storage, or networking.\\nAbility to debug, optimize code, and automate routine tasks.\\nExcellent problem-solving approach, with effective verbal and written communication skills.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Zürich, Switzerland", "lat": "47.3653139", "lon": "8.524474699999999", "address_lines": "Google Building 110, Brandschenkestrasse 110, 8002 Zürich, Switzerland", "city": "Zürich", "post_code": "8002", "country": "ZH", "country_code": "CH", "is_remote": "false", "description": "Hope is not a strategy. Engineering solutions to design, build, and maintain efficient large-scale systems is a true strategy, and a good one.Site Reliability Engineering (SRE) is an engineering discipline that combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems. SRE ensures that Google's services—both our internally critical and our externally-visible systems—have reliability and uptime appropriate to users' needs and a fast rate of improvement while keeping an ever-watchful eye on capacity and performance.SRE is also a mindset and a set of engineering approaches to running better production systems—we build our own creative engineering solutions to operations problems. Much of our software development focuses on optimizing existing systems, building infrastructure and eliminating work through automation. As SREs are responsible for the big picture of how our systems relate to each other, we use a breadth of tools and approaches to solve a broad spectrum of problems. Practices such as limiting time spent on operational work, blameless postmortems and proactive identification of potential outages factor into iterative improvement that is key to both product quality and interesting and dynamic day-to-day work.SRE's culture of diversity, intellectual curiosity, problem solving and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.To learn more:Check out Site Reliability Engineering, written by Google SREs.Watch a recorded Hangout on Air to meet some of our SREs.Read a career profile about why a software engineer chose to join SRE.\\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "education_levels": "BACHELORS_OR_EQUIVALENT", "created": "2022-12-22T07:30:54.548Z", "modified": "2022-12-22T07:30:54.548Z", "publish_date": "2022-12-22T07:30:54.650Z"}, "8": {"id": "jobs/131619825576223430", "title": "Principal Software Engineer, Control Plane, Google Cloud", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckSgKtFjJNd_voMtDA_3m7htdHBGMPDz62a9ggQzV_P8bEjsA85OaoIuKSDFpYwrPg3jkueq9AbMtAcN4PCnZTMHE3sa2N6-2SRL5x7lynMiDswfzM9rJ6S18yZjkFg%3D%3D_V2&jobTitle=Principal+Software+Engineer&loc=US", "responsibilities": "\\nOwn and drive regulatory compliance initiatives in the Google Compute Engine (GCE) team and collaborate closely with other executive leaders on initiatives across all of Google Cloud. \\nDrive technical long term strategy and the implementation and widespread adoption of solutions for Google Cloud.\\n\\n\\nDesign, develop, test, deploy, maintain, and improve software and user-facing features in Google Cloud products.\\nBuild a team and cultivate innovation by driving cross-collaboration and execution of projects across multiple teams.\\nMentor and train other team members on design techniques and coding standards to increase productivity across product areas.\\n", "qualifications": "Minimum qualifications:\\n15 years of experience with distributed systems and architecture.\\nExperience in technical leadership and setting technical direction for engineering projects.\\nTechnical leadership experience in a software design domain.\\nPreferred qualifications:\\nExperience building and owning compliance software at scale leveraging modern techniques and best practices.\\nExperience in technologies and cloud development platforms.\\nUnderstanding of existing and emerging worldwide regulatory compliance laws and frameworks (e.g., GDPR, CCPA, PCI DSS, NIST, HIPAA, SOX, FedRAMP, etc.).\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Kirkland, WA, USA", "lat": "37.09024", "lon": "-95.712891", "address_lines": "United States", "city": "null", "post_code": "None", "country": "null", "country_code": "US", "is_remote": "true", "description": "\\nOur team focuses on building scalable and intelligent Google Cloud Platform, powering innovative companies. We build tools which manage large pools of Virtual Machines, helping our customers use Google Cloud at scale. We dedicate our engineering team to innovate with the goal of making Google Cloud Platform (GCP) the first choice for customers in highly regulated industries and with compliance needs. As a Principal Software Engineer, you will lead the ideas, design, and development of cloud products and components in the space of Google Cloud Infrastructure management to make our customers more successful.Google Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.The US base salary range for this full-time position is $256,000-$384,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "education_levels": "None", "created": "2022-10-10T14:00:53.019Z", "modified": "2023-01-10T19:00:48.270Z", "publish_date": "2023-01-10T19:00:48.378Z"}, "9": {"id": "jobs/103879305181700806", "title": "Software Engineering Manager II, Infrastructure, Google Cloud Compute", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckblNVUz5yYte7Ez2Qsqx56zLNU-CjseZG6tj1zfWhRYYEjsA85OaoJvPLnUUX6g5hGGZLWhpPYsoeQrP7aK5vDTW-y3exwyPfRE4EXN_KaR4jI41QebaNf8wbeoE6A%3D%3D_V2&jobTitle=Software+Engineering+Manager+II&loc=US", "responsibilities": "\\nSet and communicate team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams. \\nSet clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching. \\nDevelop the mid-term technical vision and roadmap within the scope of your (often multiple) team(s). Evolve the roadmap to meet anticipated future requirements and infrastructure needs. \\nDesign, guide and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems. \\nReview code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree or equivalent practical experience.\\n\\n5 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, Javascript). \\n3 years of experience in a technical leadership role; overseeing strategic projects, with 2 years of experience in a people management, supervision/team leadership role.\\n3 years of experience building and developing large-scale infrastructure and/or distributed systems.\\nPreferred qualifications:\\nMaster’s degree or PhD in Engineering, Computer Science, or a related technical field.\\n\\n3 years of experience working in a complex, matrixed organization.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Seattle, WA, USA", "lat": "47.6492973", "lon": "-122.3505347", "address_lines": "Google Building Parkview, 601 N 34th St, Seattle, WA 98103, USA", "city": "Seattle", "post_code": "98103", "country": "WA", "country_code": "US", "is_remote": "false", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.With your extensive technical expertise you take initiative to independently design and implement new systems, designing, implementing, and testing multiple features with little or no direction from tech lead or manager. You collaborate with key stakeholders to determine future direction of work.\\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.The US base salary range for this full-time position is $174,000-$276,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "education_levels": "DOCTORAL_OR_EQUIVALENTMASTERS_OR_EQUIVALENTBACHELORS_OR_EQUIVALENT", "created": "2022-12-13T21:31:04.863Z", "modified": "2023-01-10T18:31:08.414Z", "publish_date": "2023-01-10T18:31:08.558Z"}, "10": {"id": "jobs/89092078627103430", "title": "Data Center Technician, Technical Infrastructure", "categories": "DATA_CENTER_OPERATIONS", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckeJbP6A00mCD1cIPYjRmGHOSziOoPWBCSKS4nG0LZPlDEjsA85OaoCuFW1C0CFAJBSK7fZ4V6k9rgklcK-WVNypvPohVWSDYBfXLPRrt6f4eUgmrUyApadMCD-I1hw%3D%3D_V2&jobTitle=Data+Center+Technician&loc=SG", "responsibilities": "\\nLead efforts and contribute to projects in the deployment, maintenance, and support of data center infrastructure.\\nParticipate or lead complex troubleshooting, and resolve critical or escalated technical issues.\\nTest and troubleshoot server hardware components and designs.\\nConfigure and troubleshoot Linux Operating System related issues on servers.\\nDeploy and maintain Google's advanced Data Center Server and Network Infrastructure.\\n", "qualifications": "Minimum qualifications:\\nExperience in maintenance and monitoring of server systems.\\nExperience working within a data center or network operation center environment.\\nExperience with operating systems and networking protocols.\\nPreferred qualifications:\\nExperience working with and troubleshooting hardware or network related issues using Linux-based tools.\\nExperience with light coding or scripting.\\nExperience in project leadership and project management.\\nAbility to collaborate and partner with stakeholders and teams to overcome challenges.\\nAbility to manage competing and changing priorities.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Singapore", "lat": "1.352083", "lon": "103.819836", "address_lines": "Singapore", "city": "null", "post_code": "None", "country": "null", "country_code": "SG", "is_remote": "false", "description": "Google isn't just a software company. The Hardware Operations team is responsible for monitoring the state-of-the-art physical infrastructure behind Google's powerful search technology. As an Operations Technician, you'll install, configure, test, troubleshoot and maintain hardware (like servers and its components) and server software (like Google's Linux cluster). You'll also take on the configuration of more complex components such as networks, routers, hubs, bridges, switches and networking protocols. You'll participate in or lead small project teams on larger installations and develop project contingency plans. A typical day involves manual movement and installation of racks, and while it can sometimes be physically demanding, you are excited to work with infrastructure that is at the cutting-edge of computer technology.\\nAs a Data Center Technician, you will deploy and maintain Data Center Server and Network Infrastructure by installing, configuring, testing, troubleshooting, and repairing hardware and server software. In this role, you will take on the configuration of more complex components such as networks, routers, bridges, and switches. You will participate in or lead local project teams on larger installations and develop project contingency plans. \\n\\nIn this role, duties range from the physical deployment of data center-related technology to working closely with various stakeholders. You will ensure that our goals, missions, and projects are successfully delivered, and that they are repeatable across our global array of data centers.  Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "education_levels": "None", "created": "2022-12-22T09:31:01.575Z", "modified": "2022-12-22T09:31:01.575Z", "publish_date": "2022-12-22T09:31:01.726Z"}, "11": {"id": "jobs/98201596518638278", "title": "Software Engineering Manager, Engineering Productivity", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckV8owP1aLoUTMJL9t6vmvd6W8gRw0wTgpC3juIjHLeg-EjsA85OaoLTDF_s1M2Y7L82B7pnQ8g7_8l9dzbAr7OUhI1TsVkhLfBQ8PP4PSrJG3loCqyxOqtoZgAWN7w%3D%3D_V2&jobTitle=Software+Engineering+Manager&loc=IN", "responsibilities": "\\nCoach and grow the team members to create a high performing team. Engage effectively with stakeholders and collaborate.\\nLead design reviews with peers and stakeholders to decide available technologies. Review code developed by other developers and provide feedback to ensure best practices.\\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\\nCreate and deliver Objectives and Key Results (OKRs) relevant for workspace engineering productivity through engagement with partner teams and correct prioritization. Write and test product or system development code.\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree or equivalent practical experience.\\n5 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\\n3 years of experience in a technical leadership role, overseeing strategic projects.\\n2 years of experience in people management, supervision/team leadership roles.\\nPreferred qualifications:\\nBachelor's degree in Computer Science.4 years of experience in technical management, software developers and systems administrators/architects.\\nExperience in designing and implementing distributed systems.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Bangalore, Karnataka, India", "lat": "17.385044", "lon": "78.486671", "address_lines": "Hyderabad, Telangana, India", "city": "Hyderabad", "post_code": "None", "country": "TG", "country_code": "IN", "is_remote": "false", "description": "Like Google's own ambitions, the work of a Software Engineer (SWE) goes way beyond just Search. SWE Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a SWE Manager you manage your project goals, contribute to product strategy and help develop your team. SWE teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "education_levels": "BACHELORS_OR_EQUIVALENT", "created": "2022-11-14T15:30:58.556Z", "modified": "2022-12-07T11:28:37.723Z", "publish_date": "2022-12-07T11:28:40.521Z"}, "12": {"id": "jobs/101016716198191814", "title": "Staff Software Engineer, Google Compute Engine, Google Cloud", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckYWMU6yBu4HS1rHf4Cb01_JAsxB1h38JK6wtlWUxga_sEjsArqK0BQvuwJqJ7aUoeXLwo9O1xfiAyMFQORmxvtmExiPaRUgl52YpwnbnFQ9s7jSI-1eW8bc5c1Ubsw%3D%3D_V2&jobTitle=Staff+Software+Engineer&loc=US", "responsibilities": "\\nArchitect, design, and implement control plane core business logic to support end user APIs and provide clear, concise, and API surface.\\nDesign high performance and scalable workflow orchestration and lifecycle management of these resources. Integrate with various lower stack layers for providing deeper functionality.\\nWork closely with software engineers, product managers, and partner engineering teams to get high-quality products and features through the software project lifecycle.\\nManage project schedules, identify technical risks and clearly communicate them to project stakeholders.\\nCoach and mentor engineers to design and implement highly available and reliable services.\\n", "qualifications": "Minimum qualifications:\\nBachelor’s degree or equivalent practical experience.\\n\\n8 years of experience in software development, and with data structures/algorithms.\\n5 years of experience testing and launching software products, and 3 years of experience with software design and architecture. \\nExperience with infrastructure technologies and distributed systems design.\\nPreferred qualifications:\\nMaster’s degree or PhD in Engineering, Computer Science, or a related technical field.\\n5 years of experience building and developing large-scale infrastructure, distributed systems or networks, and/or experience with compute technologies, storage, and/or hardware architecture.\\n3 years of experience in a technical leadership role leading project teams and setting technical direction.\\n3 years of experience working in a complex, matrixed organization involving cross-functional, and/or cross-business projects.\\nExperience with distributed systems (e.g., load-balancing and replication techniques, distributed consensus, handling of network and hardware failures).\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Kirkland, WA, USA", "lat": "36.778261", "lon": "-119.4179324", "address_lines": "California, USA", "city": "null", "post_code": "None", "country": "CA", "country_code": "US", "is_remote": "true", "description": "Google Compute Engine (GCE) is a fast-growing and strategic platform for both Google Cloud and direct public IaaS service. The GCE Cluster Management (CM) team is responsible for Control Plane logic, external REST APIs for provisioning IaaS resources and lifecycle management, focusing around storage resources (e.g., disk, image, snapshot, machine image, etc.) lifecycle, and orchestrating workflows with instance/video management system at various cloud scopes.\\n\\nWe’re on multi-year track to manage reliability, stack simplification, and differentiating features that are designed to achieve higher feature velocity and maintainability of our software stack. We deeply care about coherent and usable API surface, scalability, infrastructure quality, reliability, and maintainability, and we have projects to improve it.\\n\\nOur team is focused on fundamentals, product mentality from API experience standpoint, execution, and excellence.\\n\\nCome join a team working on distributed system problems that is critical for Google Cloud Platform along with a group of passionate, experienced, and supportive engineers.Google Cloud provides organizations with leading infrastructure, platform capabilities and industry solutions. We deliver enterprise-grade cloud solutions that leverage Google’s cutting-edge technology to help companies operate more efficiently and adapt to changing needs, giving customers a foundation for the future. Customers in more than 150 countries turn to Google Cloud as their trusted partner to solve their most critical business problems.\\nThe US base salary range for this full-time position is $174,000-$276,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "education_levels": "BACHELORS_OR_EQUIVALENTMASTERS_OR_EQUIVALENTDOCTORAL_OR_EQUIVALENT", "created": "2021-11-09T21:31:16.463Z", "modified": "2023-01-10T18:31:11.423Z", "publish_date": "2023-01-10T18:31:11.518Z"}, "13": {"id": "jobs/121504591465325254", "title": "Software Engineering Manager II, Google Cloud", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2Fckb3YOLGUJoKel1A8oAdr--pwPLWtK3TU8QPUE-UvExiWEjsA85OaoAlW9TnAKJU6wLE5WzjTOEOw6a70yMlYUCyGSxi-3bi3kSb9OE6SsFE3iLZBAHLkuTPaWfUSNA%3D%3D_V2&jobTitle=Software+Engineering+Manager+II&loc=IN", "responsibilities": "\\nSet and communicate team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams.\\nSet clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching.\\nDevelop the mid-term technical vision and roadmap within the scope of your (often multiple) team(s). Evolve the roadmap to meet anticipated future requirements and infrastructure needs.\\nDesign, guide and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems. \\n\\nReview code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\\n\\n", "qualifications": "Minimum qualifications:\\nBachelor’s degree, or equivalent practical experience.\\n\\n5 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\\n3 years of experience in a technical leadership role; overseeing strategic projects, with 2 years of experience in a people management, supervision/team leadership role.\\n\\nPreferred qualifications:\\nMaster's degree or PhD in Computer Science or related technical field.\\n\\n3 years of experience working in a complex, matrixed organization.\\n\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Bangalore, Karnataka, India", "lat": "12.9897773", "lon": "77.65366840000002", "address_lines": "3, Old Madras Rd, Sadanandanagar, Bennigana Halli, Bengaluru, Karnataka 560016, India", "city": "Bengaluru", "post_code": "560016", "country": "KA", "country_code": "IN", "is_remote": "false", "description": "Like Google's own ambitions, the work of a Software Engineer (SWE) goes way beyond just Search. SWE Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a SWE Manager you manage your project goals, contribute to product strategy and help develop your team. SWE teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "education_levels": "DOCTORAL_OR_EQUIVALENTMASTERS_OR_EQUIVALENTBACHELORS_OR_EQUIVALENT", "created": "2022-12-02T15:31:07.472Z", "modified": "2022-12-07T11:13:36.712Z", "publish_date": "2022-12-07T11:13:36.828Z"}, "14": {"id": "jobs/130115881171591878", "title": "Technical Lead, Google Cloud VMware Engine", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckUrI4y32skpkaRbYIGB68uSoZKIrY-QO87sYmcaJZ4_TEjsA85OaoJfdp52LaJdOy5eUlUNGeiKSKuJjK-b15vBzbY33WluDkLzuQHlRJz5Gxr2q5UDDLdr1zoEA8g%3D%3D_V2&jobTitle=Technical+Lead&loc=PL", "responsibilities": "\\nDesign and build large-scale distributed systems.\\nLead the implementation and delivery of projects and programs.\\nProvide technical leadership, judgment, and guidance to individuals, local teams, peer teams across the product locations.\\nOwn tech solutions, roadmap, and decisions in the Control Plane layer.\\nRepresent Control Plane layer in the discussion with peer domains.\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree in Computer Science, Mathematics, a related field, or equivalent practical experience.\\nExperience with general purpose programming languages, including but not limited to Java, C/C++, Go.\\nExperience with the design and implementation of distributed systems.\\nPreferred qualifications:\\nExperience with cloud-native application development using open source building blocks such as Docker, Ansible, Terraform, Kafka, Cassandra, Kong etc.\\nExperience with Kubernetes, Google Kubernetes Engine (GKE), or similar.\\nExperience with public cloud, including Google Cloud Platform (GCP).\\nExperience with VMWare in an enterprise environment.\\nKnowledge of private and public cloud design considerations and limitations in the areas of virtualization, global infrastructure, distributed systems, load balancing, and networking.\\nExcellent technical leadership, project management, problem solving, and troubleshooting skills.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Warsaw, Poland", "lat": "52.2296756", "lon": "21.0122287", "address_lines": "Warsaw, Poland", "city": "Warsaw", "post_code": "None", "country": "Masovian Voivodeship", "country_code": "PL", "is_remote": "false", "description": "Google Cloud's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google Cloud's needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. You will anticipate our customer needs and be empowered to act like an owner, take action and innovate. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.The Google Cloud VMware Engine enables customers running on-premises VMware workloads to seamlessly migrate to Google Cloud without having to re-architect or refactor their applications. This allows them to leverage the value of their existing VMware investments while maintaining operational continuity and avoiding data center management, hardware refreshes, and procurement cycles.In this role, you will mainly focus on control plane development using Google tools and standards with the aim of eventual merging the CloudSimple stack with internal Cloud Bare Metal efforts.\\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "education_levels": "BACHELORS_OR_EQUIVALENT", "created": "2022-11-25T13:01:11.332Z", "modified": "2022-12-12T16:31:47.187Z", "publish_date": "2022-12-12T16:31:47.458Z"}, "15": {"id": "jobs/104233397049533126", "title": "Software Engineering Manager II, Infrastructure, Google Cloud Platforms", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2Fckfhizx50WXUEk_xBhSRuqh55YG6p4GgMMGXPOFCT67sGEjoA85OaoPVM59ocZxCE5JbqSw_Bk9Pz-zbkvd8BFIZUD0vvpmFSdYAadjBlKXgH02RyuAxu3FqGoDu2_V2&jobTitle=Software+Engineering+Manager+II&loc=US", "responsibilities": "\\nSet and communicate team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams. \\nSet clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching. \\nDevelop the mid-term technical vision and roadmap within the scope of your (often multiple) team(s). Evolve the roadmap to meet anticipated future requirements and infrastructure needs. \\nDesign, guide and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems. \\nReview code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree or equivalent practical experience.\\n\\n5 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, Javascript). \\n3 years of experience in a technical leadership role; overseeing strategic projects, with 2 years of experience in a people management, supervision/team leadership role.\\n3 years of experience building and developing large-scale infrastructure and/or distributed systems.\\nPreferred qualifications:\\nMaster’s degree or PhD in Engineering, Computer Science, or a related technical field.\\n\\n3 years of experience working in a complex, matrixed organization.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Sunnyvale, CA, USA", "lat": "37.4030338", "lon": "-122.0325786", "address_lines": "Google Building TC3, 805 11th Ave, Sunnyvale, CA 94089, USA", "city": "Sunnyvale", "post_code": "94089", "country": "CA", "country_code": "US", "is_remote": "false", "description": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.With your extensive technical expertise you take initiative to independently design and implement new systems, designing, implementing, and testing multiple features with little or no direction from tech lead or manager. You collaborate with key stakeholders to determine future direction of work.\\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems. Salary Range Info: The US base salary range for this full-time position is $174,000-$276,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "education_levels": "BACHELORS_OR_EQUIVALENTMASTERS_OR_EQUIVALENTDOCTORAL_OR_EQUIVALENT", "created": "2022-11-14T10:30:51.222Z", "modified": "2023-01-10T18:30:52.870Z", "publish_date": "2023-01-10T18:30:53.550Z"}, "16": {"id": "jobs/87895663846531782", "title": "Application Engineer, SAP Analytics", "categories": "SOFTWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckZVupIGOI1EOiO529_kW9-NaNieHIfQUc4Clgh4SIsukEjsA85OaoIFQjYhTveroUBd0yaK_nRB0hNI_0dsNfcuUDwtiU_KtnEAC1ITgidDavATEWwRpfXKA5q8xiA%3D%3D_V2&jobTitle=Application+Engineer&loc=IN", "responsibilities": "\\nBe responsible for maintaining data warehouses to provide valuable insights from Google Cloud supply chain systems.\\nUnderstand Enterprise Data Warehouses, SAP BW , System Level Testing (SLT) , Big Query (BQ) or any relevant technologies in data analytics.\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree in Computer Science, Engineering or equivalent practical experience.\\n12 years of experience implementing business intelligence applications like SAP BW, SAP Analytics Cloud.\\nExperience in S/4 HANA ABAP programming, S/4 HANA Database schema, S/4 HANA architecture.\\nExperience in data warehouse design, system integration background, integration concepts.\\nPreferred qualifications:\\nExperience in building ETL pipelines.\\nCertification in Data Engineering.\\nKnowledge of SAP BW (modeling and development), BigQuery, SAP SLT for building analytics solution.\\nKnowledge of SAP BODS, BOBJ, SAC (SAP Analytics Cloud), or SQL.\\nKnowledge of Cloud, Google Cloud, and Cloud based technologies.\\nKnowledge of supply chain domain.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Bangalore, Karnataka, India", "lat": "12.9897773", "lon": "77.65366840000002", "address_lines": "3, Old Madras Rd, Sadanandanagar, Bennigana Halli, Bengaluru, Karnataka 560016, India", "city": "Bengaluru", "post_code": "560016", "country": "KA", "country_code": "IN", "is_remote": "false", "description": "You lead all aspects of web development, requirements gathering, software development, testing, documentation, training, implementation, ongoing support, and maintenance for both in-house and customer-facing web applications. You will work closely with a cross-functional team of Googlers using UI and functional specs/prototypes as input. You are empowered to act like an owner, take action and innovate to meet user and customer needs.\\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.", "education_levels": "BACHELORS_OR_EQUIVALENT", "created": "2022-12-19T12:30:59.497Z", "modified": "2022-12-19T12:30:59.497Z", "publish_date": "2022-12-19T12:30:59.713Z"}, "17": {"id": "jobs/93467265250271942", "title": "Hardware Test Engineer, Servers System, Google Cloud", "categories": "HARDWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckeTRdigeS1T9JCqrzKK98IgtXtzt8x6QLShwuQYW1VF_EjsARYnzBWencQAanPuEtHH0KDUV04nPqe1GiFrwjjXLvWOYkV6kVsVGlqwIK0a-ETgwqHF99Acgiv1G1Q%3D%3D_V2&jobTitle=Hardware+Test+Engineer&loc=TW", "responsibilities": "\\nCreate test plans and coordinate resources across many test environments.\\nPerform electrical, reliability, and performance tests to ensure hardware solutions meet Google's requirements.\\nReport bugs and drive corrective action where needed with external suppliers or internal development teams.\\nMaintain and improve the qualification process.\\nWork with ODMs/JDMs to ensure testing to Google standards.\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree in Electrical Engineering, Computer Engineering, or equivalent practical experience.\\n5 years of experience with signal integrity, power, and timing.\\n3 years of experience in a hardware test or qualification role.\\n\\nPreferred qualifications:Master's degree in Electrical Engineering.Experience in high speed design, PCIe verification, and debugging.Understanding of computer systems (physical, functional, logical, mechanical, electrical, software, thermal, etc.).Familiarity with GPU testing and verification knowledge.Demonstrated data collection skills.", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Xindian District, New Taipei City, Taiwan", "lat": "24.9832373", "lon": "121.5411281", "address_lines": "No. 145, Section 3, Beixin Rd, Xindian District, New Taipei City, Taiwan 231", "city": "Xindian District", "post_code": "231", "country": "New Taipei City", "country_code": "TW", "is_remote": "false", "description": "Google's custom-designed machines make up one of the largest and most powerful computing infrastructures in the world. The Hardware Testing Engineering team ensures that this cutting-edge equipment is reliable. In the R&D lab, you design test equipment for prototypes of our machinery and develop the protocols used to scale these tests for the entire global team. Working closely with design engineers, you give input on designs to improve our hardware until you're sure it meets Google's standards of quality and reliability.\\nAs a Hardware Test and Qualification Engineer, you will qualify servers and specialized hardware for Google's data centers.  Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "education_levels": "BACHELORS_OR_EQUIVALENTMASTERS_OR_EQUIVALENT", "created": "2022-03-09T12:02:26.110Z", "modified": "2022-12-07T11:42:58.727Z", "publish_date": "2022-12-07T11:42:58.829Z"}, "18": {"id": "jobs/122105801524290246", "title": "Network Engineer, Corporate Network Deployments", "categories": "NETWORK_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckYPYCbfZhG74EnKDghbw3qFXCLolAADb1eOrGyI6YeiwEjsA85OaoOTcn6oeu-zxSptlKrv9ODXUmtIRR0rvawuOHUTltOK7vxpBapajoF6CQtfKsqRrWqE2eBWxLQ%3D%3D_V2&jobTitle=Network+Engineer&loc=IE", "responsibilities": "\\nDesign, publish, and present network architectures, contributing to team roadmaps.\\nDevelop software integrations for new architectures, and repair workflows and device configuration generation. \\nDevelop pairwise integration tests, develop large-scale solutions, and run-scale tests.\\nPublish feature and scale requirements and contribute to life-cycle plans of record.\\nPerform network-wide rollouts and manage escalations from our partner Site Reliability Engineering teams.\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree in Network Engineering, Computer Science, Computer Engineering, or equivalent practical experience.\\nExperience with network equipment providers.\\nExperience with fundamental networking technologies and protocols (Automated Rack Placement, Ethernet, Dynamic Host Configuration Protocol (DHCP), IPSec, GRE, WiFi standards, routing protocols, Domain Name System (DNS), RADIUS, 802.1x).\\nExperience with C, C++, Go, or Python.\\nPreferred qualifications:\\nExperience in deploying and working with Local Area Networks (LANs), Wireless Local Area Networks (WLANs), and Wide Area Networks (WANs).\\nExperience in developing networking products, technologies, software, and protocols.\\nExperience with enterprise/carrier-class routers and switches.\\nExcellent verbal, written communication, and systematic problem-solving skills.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Dublin, Ireland", "lat": "53.3383682", "lon": "-6.2395669", "address_lines": "Clanwilliam Pl, Dublin, Ireland", "city": "Dublin", "post_code": "None", "country": "D", "country_code": "IE", "is_remote": "false", "description": "Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google's complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services.\\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.", "education_levels": "BACHELORS_OR_EQUIVALENT", "created": "2022-11-25T10:31:34.416Z", "modified": "2022-12-07T11:20:00.714Z", "publish_date": "2022-12-07T11:20:00.847Z"}, "19": {"id": "jobs/92068880630850246", "title": "Hardware Test Developer, Augmented Reality", "categories": "HARDWARE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckdrTsBgGPiNYlL2m6GM_H2wv3h8IFK2FESYnp9luatdREjsA85OaoLl3rmUhbdA4QPP0oSDR9RHcnU-Az_24Q_CEPQJbM_oR4kh_dxPcRIOzxUB0VgEpz_6IHRn0IQ%3D%3D_V2&jobTitle=Hardware+Test+Developer&loc=CA", "responsibilities": "\\nDevelop test methods and perform experiments in the lab to evaluate the performance of optical modules.\\nWork closely with optical and mechanical design developers to ensure optical modules are designed to be compatible with available characterization techniques.\\nDevelop and assemble prototype optical modules including automated assembly methods (e.g., automated active optical alignment processes).\\nWork cross functionally with the operations and product developing teams to implement test methods for mass production.\\nCharacterize optical element and sub-systems using standard optical metrology equipment.\\n", "qualifications": "Minimum qualifications:\\nBachelor’s degree in Electrical Engineering, Computer Engineering, Physics, a related field, or equivalent practical experience.\\n2 years of experience working in a technical environment, or 1 year of experience with an advanced degree.\\nPreferred qualifications:\\nMaster's degree or PhD in Electrical Engineering, Computer Engineering, Physics, or a related field.\\n5 years of experience as a test developer in a volume manufacturing environment and/or optical lab environment.\\n3 years of experience with standard optical metrology techniques (e.g., machine vision, interferometry, confocal microscopy, optical power and wavelength measurements).\\n3 years of experience in optical lab environments including implementation of lab automation methods (e.g., programming motorized stages, automated data acquisition).\\nExperience with Gage R&R and other statistical measurement system analysis.\\nExperience with optical design software (e.g., zemax or code V).\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Waterloo, ON, Canada", "lat": "43.4642578", "lon": "-80.5204096", "address_lines": "Waterloo, ON, Canada", "city": "Waterloo", "post_code": "None", "country": "ON", "country_code": "CA", "is_remote": "false", "description": "\\nThe Google Augmented Reality team is a diverse group of experts tasked with building the foundations for great immersive computing and building helpful, delightful user experiences. We're focused on making immersive computing accessible to billions of people through mobile devices, and our scope continues to grow and evolve.", "education_levels": "BACHELORS_OR_EQUIVALENTMASTERS_OR_EQUIVALENTDOCTORAL_OR_EQUIVALENT", "created": "2022-12-06T16:01:23.237Z", "modified": "2022-12-07T11:01:30.738Z", "publish_date": "2022-12-07T11:01:30.882Z"}, "20": {"id": "jobs/119139052965241542", "title": "Application Engineer, Supply Chain System", "categories": "TECHNICAL_INFRASTRUCTURE_ENGINEERING", "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiUAL2FckdbbY7TpQjLuwT0o6fDp83NFrcmgb2RPsfwR0BRUUPGuEjsAbmRECSVZrjNunGdFuvIkmixqZO-88fQO3_YjQeTMQXV939Vwwc8Ka2IJx-vCap5Btefcu7pniM-eIA%3D%3D_V2&jobTitle=Application+Engineer&loc=US", "responsibilities": "\\nDevelop and deploy applications to align the business goals and create impact.\\nPartner with the Alphabet Supply Chain Intelligence and Innovation (ASCII) Engineering or Business teams to define and implement solutions that improve internal business processes.\\nWork with analysts to translate business requirements into technical solutions.\\n\\nBuild internal solutions, with custom user experience (UX) and services that automate business processes.\\nMaintain development best practices, test documentation or execution, and issue identification or resolution.\\n", "qualifications": "Minimum qualifications:\\nBachelor's degree in Computer Science, a related technical field, or equivalent practical experience.\\n\\n8 years of experience in developing internal business applications or integrations.\\nExperience in the following programming languages: Java, JavaScript, and web services technology.\\nPreferred qualifications:\\nExperience in multiple full system implementation lifecycles (e.g., analyze, design, build, test, implement, support).\\nExperience in implementing, customizing, and integrating third-party applications.\\nExperience in the supply chain logistics domain.\\n\\nExperience with Google Cloud Platform.\\n\\nAbility to take initiative.\\nExcellent communication and problem-solving skills.\\n", "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc", "company_name": "Google", "language_code": "en-US", "locations": "Sunnyvale, CA, USA", "lat": "37.09024", "lon": "-95.712891", "address_lines": "United States", "city": "null", "post_code": "None", "country": "null", "country_code": "US", "is_remote": "true", "description": "At Google, we work at lightning speed. So when things get in the way of progress, the Business Systems Integration team steps in to remove those roadblocks. The team identifies time-consuming internal processes and then builds solutions that are reliable and scalable enough to work within the size and scope of the company. You listen to and translate Googler needs into high-level technical specifications, design and develop recommended systems and consult with Google executives to ensure smooth implementation. Whether battling large system processes or leveraging our homegrown suite of Google products for Googlers themselves, you help Googlers work faster and more efficiently.\\nAs the Application Engineer, you will design, build, operate integrations, and Application Programming Interfaces (APIs) services in Google’s development environment along with applications and services from third-party vendors in Google Cloud. You will collaborate directly with users, business partners, software vendors, and other Engineering teams to increase the speed, reliability, and value of our logistics systems. Travel during design sessions and launches as necessary.Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.The US base salary range for this full-time position is $96,000-$144,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "education_levels": "BACHELORS_OR_EQUIVALENT", "created": "2023-01-26T14:30:50.163Z", "modified": "2023-02-08T13:30:24.600Z", "publish_date": "2023-02-08T13:30:24.751Z"}}